Roberto-Rod/OCC_Main/arm1_mcu_firmware/Quadrature_Encoder/boards/evkmimxrt1170/apps/arm1_dev_kit/cm7/pin_mux.c
/*
 * Copyright 2021 Embedded Artists AB
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* GPIO_EMC */
#define EMC_ODE       (1<<4) /* open drain enabled */
#define EMC_PULL_UP   (1<<2) /* weak pull up + enable pull */
#define EMC_PULL_DOWN (2<<2) /* weak pull down + enable pull */
#define EMC_PULL_NONE (3<<2) /* pull disabled */
#define EMC_DRV_HI    (0<<1) /* high drive strength */
#define EMC_DRV_NORM  (1<<1) /* normal drive strength */

/* GPIO_SD */
#define SD_ODE       (1<<4) /* open drain enabled */
#define SD_PULL_UP   (1<<2) /* weak pull up + enable pull */
#define SD_PULL_DOWN (2<<2) /* weak pull down + enable pull */
#define SD_PULL_NONE (3<<2) /* pull disabled */
#define SD_DRV_HI    (0<<1) /* high drive strength */
#define SD_DRV_NORM  (1<<1) /* normal drive strength */

/* GPIO_DISP_B1 */
#define DISP_B1_ODE       (1<<4) /* open drain enabled */
#define DISP_B1_PULL_UP   (1<<2) /* weak pull up + enable pull */
#define DISP_B1_PULL_DOWN (2<<2) /* weak pull down + enable pull */
#define DISP_B1_PULL_NONE (3<<2) /* pull disabled */
#define DISP_B1_DRV_HI    (0<<1) /* high drive strength */
#define DISP_B1_DRV_NORM  (1<<1) /* normal drive strength */

/* GPIO_DISP_B2 */
#define DISP_B2_ODE       (1<<4) /* open drain enabled */
#define DISP_B2_PULL_UP   (3<<2) /* weak pull up + enable pull */
#define DISP_B2_PULL_DOWN (1<<2) /* weak pull down + enable pull */
#define DISP_B2_PULL_NONE (0<<2) /* pull disabled */
#define DISP_B2_DRV_HI    (1<<1) /* high drive strength */
#define DISP_B2_DRV_NORM  (0<<1) /* normal drive strength */
#define DISP_B2_SLEW_FAST (1<<0) /* fast slew rate */
#define DISP_B2_SLEW_SLOW (0<<0) /* slow slew rate */

/* GPIO_AD */
#define AD_ODE       (1<<4) /* open drain enabled */
#define AD_PULL_UP   (3<<2) /* weak pull up + enable pull */
#define AD_PULL_DOWN (1<<2) /* weak pull down + enable pull */
#define AD_PULL_NONE (0<<2) /* pull disabled */
#define AD_DRV_HI    (1<<1) /* high drive strength */
#define AD_DRV_NORM  (0<<1) /* normal drive strength */
#define AD_SLEW_FAST (1<<0) /* fast slew rate */
#define AD_SLEW_SLOW (0<<0) /* slow slew rate */

/* GPIO_LPSR */
#define LPSR_ODE       (1<<5) /* open drain enabled */
#define LPSR_PULL_UP   (3<<2) /* weak pull up + enable pull */
#define LPSR_PULL_DOWN (1<<2) /* weak pull down + enable pull */
#define LPSR_PULL_NONE (0<<2) /* pull disabled */
#define LPSR_DRV_HI    (1<<1) /* high drive strength */
#define LPSR_DRV_NORM  (0<<1) /* normal drive strength */
#define LPSR_SLEW_FAST (1<<0) /* fast slew rate */
#define LPSR_SLEW_SLOW (0<<0) /* slow slew rate */

/* GPIO_SNVS */
#define SNVS_ODE       (1<<6) /* open drain enabled */
#define SNVS_PULL_UP   (3<<2) /* weak pull up + enable pull */
#define SNVS_PULL_DOWN (1<<2) /* weak pull down + enable pull */
#define SNVS_PULL_NONE (0<<2) /* pull disabled */
#define SNVS_DRV_HI    (1<<1) /* high drive strength */
#define SNVS_DRV_NORM  (0<<1) /* normal drive strength */
#define SNVS_SLEW_FAST (1<<0) /* fast slew rate */
#define SNVS_SLEW_SLOW (0<<0) /* slow slew rate */

#define MUST_FIX_THIS  (-1)

typedef enum {
    input, out_high, out_low,
} gpio_type_t;

/*******************************************************************************
 * Variables
 ******************************************************************************/

/* Guard to prevent multiple initialization of pins in cases where main()
 * calls multiple BOARD_Init* functions, like for example both
 * BOARD_InitPins() and BOARD_InitLpuartPins().
 */
static bool first_time_calling = true;

/*******************************************************************************
 * Code
 ******************************************************************************/

/* Convenience function so that both calls to SetPinMux and SetPinConfig can
 * be done on one line without repetition
 */
static void SETUP(uint32_t muxRegister,
                  uint32_t muxMode,
                  uint32_t inputRegister,
                  uint32_t inputDaisy,
                  uint32_t configRegister,
                  uint32_t inputOnfield,
                  uint32_t configValue) {

    *((volatile uint32_t*) muxRegister) =
            IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(muxMode) | IOMUXC_SW_MUX_CTL_PAD_SION(inputOnfield);

    if (inputRegister != 0UL) {
        *((volatile uint32_t*) inputRegister) = inputDaisy;
    }
    if (configRegister != 0UL) {
        *((volatile uint32_t*) configRegister) = configValue;
    }
}

/* Same as SETUP() but also configures GPIO for pin
 */
static void SETUPG(uint32_t muxRegister,
                   uint32_t muxMode,
                   uint32_t inputRegister,
                   uint32_t inputDaisy,
                   uint32_t configRegister,
                   uint32_t inputOnfield,
                   uint32_t configValue,
                   GPIO_Type *port,
                   uint32_t pin,
                   gpio_type_t type) {

    *((volatile uint32_t*) muxRegister) =
            IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(muxMode) | IOMUXC_SW_MUX_CTL_PAD_SION(inputOnfield);

    if (inputRegister != 0UL) {
        *((volatile uint32_t*) inputRegister) = inputDaisy;
    }
    if (configRegister != 0UL) {
        *((volatile uint32_t*) configRegister) = configValue;
    }
    gpio_pin_config_t cfg = {
        .direction     = (type == input) ? kGPIO_DigitalInput : kGPIO_DigitalOutput,
        .interruptMode = kGPIO_NoIntmode,
        .outputLogic   = (type == out_high) ? 1 : 0,
    };
    GPIO_PinInit(port, pin, &cfg);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins_uCOM_Board
 * Description   : Initializes pins available on the iMXRT1176 uCOM Board
 *
 * END ****************************************************************************************************************/
static void BOARD_InitPins_uCOM_Board(void) {
    CLOCK_EnableClock(kCLOCK_Iomuxc);
    CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);

    /* UART-A, Main console UART */
    SETUP(IOMUXC_GPIO_AD_24_LPUART1_TXD, 0, AD_PULL_NONE + AD_DRV_HI + AD_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_AD_25_LPUART1_RXD, 1, AD_PULL_NONE + AD_DRV_HI + AD_SLEW_SLOW);

    /* UART-B, Console UART for Cortex-M4 */
    SETUP(IOMUXC_GPIO_EMC_B1_40_LPUART6_TXD, 0, EMC_PULL_NONE + EMC_DRV_HI);
    SETUP(IOMUXC_GPIO_EMC_B1_41_LPUART6_RXD, 1, EMC_PULL_NONE + EMC_DRV_HI);

    /* UART-C, Used by Microbus and M.2 Bluetooth */
    SETUP(IOMUXC_GPIO_AD_00_LPUART7_TXD,   0, AD_PULL_NONE + AD_DRV_HI + AD_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_AD_01_LPUART7_RXD,   1, AD_PULL_NONE + AD_DRV_HI + AD_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_AD_02_LPUART7_CTS_B, 0, AD_PULL_NONE + AD_DRV_HI + AD_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_AD_03_LPUART7_RTS_B, 1, AD_PULL_NONE + AD_DRV_HI + AD_SLEW_SLOW);

    /* SD1_VSELECT: NVCC_SD fixed at 1.8V (by setting this signal high)
     * This pin is used as an GPIO for Wi-Fi examples but must be switched to SD1_VSELECT
     * when using SDCARD examples, see BOARD_InitSDCardPins() below. */
    SETUPG(IOMUXC_GPIO_AD_34_GPIO10_IO01, 0, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW, GPIO10, 1, out_high);

    /* WDOG */
    SETUPG(IOMUXC_GPIO_AD_04_GPIO9_IO03, 0, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW, GPIO9, 3, out_low);

    /* BOOT */
    SETUPG(IOMUXC_GPIO_LPSR_02_GPIO12_IO02, 0, LPSR_PULL_NONE + LPSR_DRV_HI + LPSR_SLEW_SLOW, GPIO12, 2, input);
    SETUPG(IOMUXC_GPIO_LPSR_03_GPIO12_IO03, 0, LPSR_PULL_NONE + LPSR_DRV_HI + LPSR_SLEW_SLOW, GPIO12, 3, input);

