Roberto-Rod/OCC_Main/arm1_mcu_firmware/Quadrature_Encoder/boards/evkmimxrt1170/apps/arm1_dev_kit/cm7/pin_mux.c
        /* SAI - This interface is connected to the E-key M.2 connector (J33) */
        SETUP(IOMUXC_GPIO_AD_17_SAI1_MCLK,      1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_18_SAI1_RX_SYNC,   1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_19_SAI1_RX_BCLK,   1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_20_SAI1_RX_DATA00, 1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_21_SAI1_TX_DATA00, 1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_22_SAI1_TX_BCLK,   1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_23_SAI1_TX_SYNC,   1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        IOMUXC_GPR->GPR0 = ((IOMUXC_GPR->GPR0 &
               (~(IOMUXC_GPR_GPR0_SAI1_MCLK_DIR_MASK)))  /* Mask bits to zero which are setting */
               | IOMUXC_GPR_GPR0_SAI1_MCLK_DIR(0x01U)  /* SAI1_MCLK signal direction control: 0x01U */
        );

        /* Bluetooth UART 1V8 */
        SETUP(IOMUXC_GPIO_SD_B2_00_LPUART9_TXD,   1, SD_PULL_DOWN + SD_DRV_HI);
        SETUP(IOMUXC_GPIO_SD_B2_01_LPUART9_RXD,   1, SD_PULL_DOWN + SD_DRV_HI);
        SETUP(IOMUXC_GPIO_SD_B2_02_LPUART9_CTS_B, 1, SD_PULL_DOWN + SD_DRV_HI);
        SETUP(IOMUXC_GPIO_SD_B2_03_LPUART9_RTS_B, 1, SD_PULL_DOWN + SD_DRV_HI);

        /* BT/WL
         *
         * BT_REG_ON:        GPIO13.4
         * BT_DEV_WAKE:      GPIO13.5
         * BT_HOST_WAKE:     GPIO13.6
         * WL_REG_ON:        GPIO13.7
         * WL_DEV_WAKE:      GPIO13.8
         * WL_HOST_WAKE_1V8: GPIO10.13
         */
        SETUPG(IOMUXC_GPIO_SNVS_01_DIG_GPIO13_IO04, 1, SNVS_PULL_DOWN + SNVS_DRV_NORM + SNVS_SLEW_SLOW, GPIO13, 4, out_low);
        SETUPG(IOMUXC_GPIO_SNVS_02_DIG_GPIO13_IO05, 1, SNVS_PULL_DOWN + SNVS_DRV_NORM + SNVS_SLEW_SLOW, GPIO13, 5, out_high);
        SETUPG(IOMUXC_GPIO_SNVS_03_DIG_GPIO13_IO06, 1, SNVS_PULL_DOWN + SNVS_DRV_NORM + SNVS_SLEW_SLOW, GPIO13, 6, input);
        SETUPG(IOMUXC_GPIO_SNVS_04_DIG_GPIO13_IO07, 1, SNVS_PULL_DOWN + SNVS_DRV_NORM + SNVS_SLEW_SLOW, GPIO13, 7, out_low);
        SETUPG(IOMUXC_GPIO_SNVS_05_DIG_GPIO13_IO08, 1, SNVS_PULL_DOWN + SNVS_DRV_NORM + SNVS_SLEW_SLOW, GPIO13, 8, out_low);
        SETUPG(IOMUXC_GPIO_SD_B2_04_GPIO10_IO13,    1, SD_PULL_UP + SD_DRV_NORM, GPIO10, 13, input);

        /* USB1 */
        SETUP(IOMUXC_GPIO_AD_09_USBPHY1_OTG_ID, 1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_10_USB_OTG1_PWR,   1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_11_USB_OTG1_OC,    1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);

        /* USB2 */
        SETUP(IOMUXC_GPIO_AD_06_USB_OTG2_OC,    1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_07_USB_OTG2_PWR,   1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_AD_08_USBPHY2_OTG_ID, 1, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW);

        /* MIPI Touch
         *
         * CTP_IRQ: GPIO3.25   (initialized above when intializing the 100/10Mbit Ethernet-PHY Adapter)
         * CTP_RST: GPIO9.26   (initialized above when intializing the 100/10Mbit Ethernet-PHY Adapter)
         */
        //SETUPG(IOMUXC_GPIO_AD_26_GPIO_MUX3_IO25, 1, AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW, GPIO3, 25, input);
        //SETUPG(IOMUXC_GPIO_AD_27_GPIO9_IO26,     0, AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW, GPIO9, 26, out_high);

        /* CSI/Camera
         *
         * CAMERA_PWDN: GPIO9.14
         * CAMERA_RST:  GPIO9.15
         */
        SETUPG(IOMUXC_GPIO_AD_15_GPIO9_IO14, 0, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW, GPIO9, 14, out_low);
        SETUPG(IOMUXC_GPIO_AD_16_GPIO9_IO15, 0, AD_PULL_DOWN + AD_DRV_NORM + AD_SLEW_SLOW, GPIO9, 15, out_low);

        /* FLEXCAN3 - No transceiver but the pins are available on expansion connector J15-37 and J15-38 */
        SETUP(IOMUXC_GPIO_LPSR_00_FLEXCAN3_TX, 1, LPSR_PULL_NONE + LPSR_DRV_HI + LPSR_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_LPSR_01_FLEXCAN3_RX, 1, LPSR_PULL_NONE + LPSR_DRV_HI + LPSR_SLEW_SLOW);
        
        /* ENC */
        IOMUXC_SetPinMux(
            IOMUXC_GPIO_DISP_B1_09_XBAR1_INOUT35,   /* GPIO_DISP_B1_09 is configured as XBAR1_INOUT35 */
            1u);                                    /* Software Input On Field: Force input path of pad GPIO_DISP_B1_09 */
        IOMUXC_SetPinMux(
            IOMUXC_GPIO_DISP_B1_08_XBAR1_INOUT34,   /* GPIO_DISP_B1_08 is configured as XBAR1_INOUT34 */
            1u);                                    /* Software Input On Field: Force input path of pad GPIO_DISP_B1_08 */
        IOMUXC_SetPinMux(
            IOMUXC_GPIO_DISP_B1_06_XBAR1_INOUT32,   /* GPIO_DISP_B1_06 is configured as XBAR1_INOUT32 */
            1u);                                    /* Software Input On Field: Force input path of pad GPIO_DISP_B1_06 */
        IOMUXC_GPR->GPR21 = ((IOMUXC_GPR->GPR21 &
          (~(IOMUXC_GPR_GPR21_IOMUXC_XBAR_DIR_SEL_35_MASK | IOMUXC_GPR_GPR21_IOMUXC_XBAR_DIR_SEL_34_MASK | IOMUXC_GPR_GPR21_IOMUXC_XBAR_DIR_SEL_32_MASK))) /* Mask bits to zero which are setting */
            | IOMUXC_GPR_GPR21_IOMUXC_XBAR_DIR_SEL_35(0x00U) /* IOMUXC XBAR_INOUT35 function direction select: 0x00U */
            | IOMUXC_GPR_GPR21_IOMUXC_XBAR_DIR_SEL_34(0x00U) /* IOMUXC XBAR_INOUT34 function direction select: 0x00U */
            | IOMUXC_GPR_GPR21_IOMUXC_XBAR_DIR_SEL_32(0x00U) /* IOMUXC XBAR_INOUT32 function direction select: 0x00U */
          );
    }
}

void BOARD_InitPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void BOARD_InitBootPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void BOARD_InitEnetPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void BOARD_InitEnet1GPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void BOARD_InitMipiPanelPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();

    /* I2C-C for touch */
    SETUP(IOMUXC_GPIO_AD_33_LPI2C1_SDA, 1, AD_ODE + AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW); // In conflict with IOMUXC_GPIO_AD_33_ENET_MDIO
    SETUP(IOMUXC_GPIO_AD_32_LPI2C1_SCL, 1, AD_ODE + AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW); // In conflict with IOMUXC_GPIO_AD_32_ENET_MDC
}
void BOARD_InitLCDPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();

