Roberto-Rod/OCC_Main/arm1_mcu_firmware/Quadrature_Encoder/boards/evkmimxrt1170/apps/arm1_dev_kit/cm7/pin_mux.c
    /*
     * The parallel RGB interface pins overlap with the interface to the
     * Ethernet-Phy on the iMX RT1176 uCOM board. The RGB interface can
     * only be used on iMX RT1176 uCOM board with a special mounting option
     * where the Ethernet-Phy is not mounted.
     */

    SETUP(IOMUXC_GPIO_DISP_B1_00_VIDEO_MUX_LCDIF_CLK,    0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_01_VIDEO_MUX_LCDIF_ENABLE, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_02_VIDEO_MUX_LCDIF_HSYNC,  0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_03_VIDEO_MUX_LCDIF_VSYNC,  0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);

    SETUP(IOMUXC_GPIO_DISP_B1_04_VIDEO_MUX_LCDIF_DATA00, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_05_VIDEO_MUX_LCDIF_DATA01, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_06_VIDEO_MUX_LCDIF_DATA02, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_07_VIDEO_MUX_LCDIF_DATA03, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_08_VIDEO_MUX_LCDIF_DATA04, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_09_VIDEO_MUX_LCDIF_DATA05, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_10_VIDEO_MUX_LCDIF_DATA06, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_11_VIDEO_MUX_LCDIF_DATA07, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B2_00_VIDEO_MUX_LCDIF_DATA08, 0U, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B2_01_VIDEO_MUX_LCDIF_DATA09, 0U, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B2_02_VIDEO_MUX_LCDIF_DATA10, 0U, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B2_03_VIDEO_MUX_LCDIF_DATA11, 0U, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B2_04_VIDEO_MUX_LCDIF_DATA12, 0U, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B2_05_VIDEO_MUX_LCDIF_DATA13, 0U, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B2_06_VIDEO_MUX_LCDIF_DATA14, 0U, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B2_07_VIDEO_MUX_LCDIF_DATA15, 0U, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
